// ==  შედარების ოპერატორი რომელიც მონაცემის მნიშვნელობებს ადარებს 
// === შედარების ოპერატორი რომელიც მონაცემის მნიშვნელობას და ტიპს  ადარებს 
// >   შედარების ოპერატორი მეტობა
// <   შედარების ოპერატორი ნაკლებობა
// >=  შედარების ოპერატორი მეტია ან ტოლია
// <=  შედარების ოპერატორი მეტია ან ტოლია
// ! შებრუნების ოპერატორი
// ++ მნიშვნელობის გაზრდა 1
// -- მნიშვნელობის დაპატარავება  1
// += საკუთარ თავზე მოქმედება საკუთარი მნიშვნელობით
// % მოდულური ოპერატორი აბრუნებს ნაშთს
// &&  'და' ოპერატორი
// ||  'ან' ოპერატორი


let sum = 20;
let delyprice = 20;
let pass = 123;
 
 
 
if(sum  >= 100 &&  pass == 123){
 document.getElementById('ou').innerHTML = 'უფასო მიწოდება';
}else{
    document.getElementById('ou').innerHTML = `მიტანის ღირებულება არის ${delyprice}₾`;
}

if(1 > 4){
    console.log('ok');
}else if(5 > 8) {
    console.log('ok 1');
}else if(10 == 11){
    console.log('ok 2');
}else{
    console.log('ok 3');
}


function checkNaumber(str){
    let find = str.match(/[0-9]/);
  if (find != null) {
    return true;
  }

  return false;
}
 if (checkNaumber('საჯკდფჰდჯსა23')) {
    console.log('ნაპოვნია რიცხვი');
 }
 
 

